<template>
  <div>
    <div class="relative">
      <svg
        class="absolute top-2.5 left-2"
        width="12"
        height="14"
        viewBox="0 0 12 14"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        @click="toLogin"
      >
        <path
          d="M11 5.99994H3.41002L6.71002 2.70994C6.89832 2.52164 7.00411 2.26624 7.00411 1.99994C7.00411 1.73364 6.89832 1.47825 6.71002 1.28994C6.52172 1.10164 6.26632 0.99585 6.00002 0.99585C5.73372 0.99585 5.47832 1.10164 5.29002 1.28994L0.290018 6.28994C0.198978 6.38505 0.127613 6.49719 0.0800184 6.61994C-0.0199996 6.8634 -0.0199996 7.13648 0.0800184 7.37994C0.127613 7.50269 0.198978 7.61484 0.290018 7.70994L5.29002 12.7099C5.38298 12.8037 5.49358 12.8781 5.61544 12.9288C5.7373 12.9796 5.86801 13.0057 6.00002 13.0057C6.13203 13.0057 6.26274 12.9796 6.3846 12.9288C6.50645 12.8781 6.61706 12.8037 6.71002 12.7099C6.80375 12.617 6.87814 12.5064 6.92891 12.3845C6.97968 12.2627 7.00582 12.132 7.00582 11.9999C7.00582 11.8679 6.97968 11.7372 6.92891 11.6154C6.87814 11.4935 6.80375 11.3829 6.71002 11.2899L3.41002 7.99994H11C11.2652 7.99994 11.5196 7.89458 11.7071 7.70705C11.8947 7.51951 12 7.26516 12 6.99994C12 6.73472 11.8947 6.48037 11.7071 6.29283C11.5196 6.1053 11.2652 5.99994 11 5.99994Z"
          fill="#0E1F34"
        />
      </svg>

      <h1 class="text-2xl text-center mt-10 mb-10 font-semibold">
        Выберите рейс
      </h1>
    </div>
    <div class="p-2">
      <race
        v-for="(r, index) in races"
        :key="index"
        :race="r"
        @choose="selectRace(r)"
      />
    </div>
  </div>
</template>

<script>
import Race from '../components/Race'
export default {
  name: 'ChooseRace',
  components: { Race },
  data() {
    return {
      // TODO: здесь должен отработать класс Бори и заполнить этот массив
      // чтобы получить данные, надо сделать так
      // this.$store.state["user/departureTime"]
      races: [
        {
          race: 'WZ 121',
          from: {
            city: 'Москва',
            airport: 'Шереметьево',
            time: '00:15',
          },
          to: {
            city: 'Сочи',
            airport: 'Сочи',
            time: '02:45',
          },
        },
        {
          race: 'FV 6499',
          from: {
            city: 'Москва',
            airport: 'Шереметьево',
            time: '00:35',
          },
          to: {
            city: 'Сочи',
            airport: 'Сочи',
            time: '03:05',
          },
        },
      ],
    }
  },
  methods: {
    selectRace(race) {
      // TODO тут что-то с ним надо будет сделать, чтобы получать норм рекомендации
      // То, что там observer, это нормально, так и должно быть
      console.log(race)
      this.$router.push('/questions')
    },
    toLogin() {
      this.$router.push('/login')
    },
  },
}
</script>

<style scoped></style>
